///*Создайте программу, имитирующую многоквартирный дом. Необходимо иметь классы «Человек», «Квартира», 
//«Дом». Класс «Квартира» содержит динамический массив объектов класса «Человек». Класс «Дом» содержит массив 
//объектов класса «Квартира». Каждый из классов содержит переменные-члены и функции-члены, которые необходимы для предметной области 
//класса. Обращаем ваше внимание, что память под строк ФИО в классе «Человек». Не забывайте обеспечить классы 
//различными конструкторами (конструктор копирования обязателен), деструкторами. В main протестировать работу полученного набора классов. */
//#include<iostream>
//#include "Apt.h"
//#include "house.h"
//#include "Human.h"
//using namespace std;
//
//void main()
//{
//	setlocale(0, "Rus");
//	House* home = new House[1];
//	home->set_parametr_House();
//	home->showHouse();
//	
//}
